---
title: "Indexing and selecting DataFrames"
date: 2020-04-12T14:41:32+02:00
author: "Othmane Rifki"
type: technical_note
draft: false
---

### DataFrames
store tabular data where you can label the rows and the columns.

#### Generate some data

In [8]:
import pandas as pd

# Build cars DataFrame
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]
row_labels = ['US', 'AUS', 'JPN', 'IN', 'RU', 'MOR', 'EG']
cars_dict = {'country':names, 'drives_right':dr, 'cars_per_cap':cpc }
cars = pd.DataFrame(cars_dict)
cars.index = row_labels
print(cars)

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JPN          Japan         False           588
IN           India         False            18
RU          Russia          True           200
MOR        Morocco          True            70
EG           Egypt          True            45

### Square brackets
The single bracket version gives a Pandas Series, the double bracket version gives a Pandas DataFrame.

#### Columns

In [23]:
# Print out country column as Pandas Series
cars['country']

US     United States
AUS        Australia
JPN            Japan
IN             India
RU            Russia
MOR          Morocco
EG             Egypt
Name: country, dtype: object

In [22]:
# Print out country column as Pandas DataFrame
cars[['country']]

           country
US   United States
AUS      Australia
JPN          Japan
IN           India
RU          Russia
MOR        Morocco
EG           Egypt

In [21]:
# Print out DataFrame with country and drives_right columns
cars[['country','drives_right']]

           country  drives_right
US   United States          True
AUS      Australia         False
JPN          Japan         False
IN           India         False
RU          Russia          True
MOR        Morocco          True
EG           Egypt          True

#### Rows

In [25]:
# Print out first 3 observations
cars[0:3]

           country  drives_right  cars_per_cap
US   United States          True           809
AUS      Australia         False           731
JPN          Japan         False           588

In [26]:
# Print out fourth, fifth and sixth observation
print(cars[3:6])

     country  drives_right  cars_per_cap
IN     India         False            18
RU    Russia          True           200
MOR  Morocco          True            70

### Selecting rows and columns with `loc` and `iloc`
`loc` is label-based, which means that you have to specify rows and columns based on their row and column labels   
`iloc` is integer index based, so you have to specify rows and columns by their integer index like you did in the previous exercise

In [28]:
# Selecting rows based on index column
# One bracket -> Series
cars.loc['RU']

country         Russia
drives_right      True
cars_per_cap       200
Name: RU, dtype: object

In [31]:
cars.iloc[4]

country         Russia
drives_right      True
cars_per_cap       200
Name: RU, dtype: object

In [55]:
# Two bracket -> DataFrame
cars.loc[['RU']]

   country  drives_right  cars_per_cap
RU  Russia          True           200

In [30]:
cars.loc[['RU', 'AUS']]

       country  drives_right  cars_per_cap
RU      Russia          True           200
AUS  Australia         False           731

In [39]:
cars.loc[:,['drives_right']]

     drives_right
US           True
AUS         False
JPN         False
IN          False
RU           True
MOR          True
EG           True

In [40]:
cars.loc[['US', 'MOR'],['drives_right']]

     drives_right
US           True
MOR          True

In [51]:
cars.iloc[0:6,[2]]

     cars_per_cap
US            809
AUS           731
JPN           588
IN             18
RU            200
MOR            70

In [53]:
cars.loc['US':'MOR',['cars_per_cap']]

     cars_per_cap
US            809
AUS           731
JPN           588
IN             18
RU            200
MOR            70